import os

from dotenv import load_dotenv
from google import genai  
from pydantic import BaseModel, Field


load_dotenv()


class AdvertisementCheckMessage(BaseModel):
    answer: bool = Field(..., description="True if the message contains advertisement or spam, False otherwise.")


client = genai.Client(
    api_key=os.environ.get("GEMINI_API_KEY")
)

mess = """
    🏠 Единый ЖКХ Бот — ваш официальный цифровой помощник по всем вопросам жилищно-коммунального хозяйства!
    С ним вы сможете:
    ✅ Передавать показания счётчиков за несколько секунд
    💳 Просматривать и оплачивать счета онлайн
    🔧 Оформлять заявки на ремонт и техническое обслуживание
    📢 Получать актуальные новости и уведомления от управляющей компании
    ✉️ Отправлять обращения, предложения и жалобы напрямую
    📊 Отслеживать историю платежей и анализировать расходы

    Все услуги ЖКХ — в одном удобном Telegram-боте!
    🚀 Просто откройте Telegram и найдите ПОМОЩНИК ЖКХ
"""

response = client.models.generate_content(
    model="gemini-2.5-flash",
    contents=f"""
    {mess}

    Если сообщение выше содержит спам, рекламу или нежелательный контент, ответь только "True", если нет - "False".
    """,
    config={
        "response_mime_type": "application/json",
        "response_json_schema": AdvertisementCheckMessage.model_json_schema(),
    },
)

print(response.text)

